In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
plt.style.use('seaborn')
import re

In [2]:
inocar = pd.read_excel('Final.xlsx',header=None)
inocar.head()

      0     1       2      3   4        5  6          7                     8
0  Audi  1968  Diesel  20.38  A3  3491000  5  Automatic   35 TDI Premium Plus
1  Audi  1968  Diesel  20.38  A3  3669000  5  Automatic     35 TDI Technology
2  Audi  1395  Petrol   19.2  A3  3310000  5  Automatic  35 TFSI Premium Plus
3  Audi  1395  Petrol   19.2  A3  3510000  5  Automatic    35 TFSI Technology
4  Audi  1968  Diesel  15.73  Q3  3653000  5     Manual    30 TDI Premium FWD

In [3]:
inocar.iloc[0:50,1].values

array([1968, 1968, 1395, 1395, 1968, 1968, 1395, 1968, 1968, 1395, 1395,
       1968, 1798, 1968, 1968, 1984, 1984, 1968, 1968, 1798, 1984, 1968,
       3993, 2967, 4134, 6299, 2967, '814 cc', '814 cc', '814 cc',
       '814 cc', '814 cc', '998 cc', '814 cc', '998 cc', '814 cc',
       '814 cc', '814 cc', '1582 cc', '1582 cc', '1582 cc', '1999 cc',
       '1999 cc', '1797 cc', '1999 cc', '1999 cc', '1582 cc', '1197 cc',
       '1197 cc', '1186 cc'], dtype=object)

> Coloumn-1 has categorical(string) values, changing data type string into integers in coloumn-1

*some rows has 'cc' along with numeric*

In [4]:
for i in range(len(inocar[1])):
    if type(inocar.iloc[i,1]) != int:
        string = inocar.iloc[i,1]
        num = re.findall('\d+',string)
        inocar.iloc[i,1] = int(num[0])

In [5]:
inocar.iloc[0:50,1].values

array([1968, 1968, 1395, 1395, 1968, 1968, 1395, 1968, 1968, 1395, 1395,
       1968, 1798, 1968, 1968, 1984, 1984, 1968, 1968, 1798, 1984, 1968,
       3993, 2967, 4134, 6299, 2967,  814,  814,  814,  814,  814,  998,
        814,  998,  814,  814,  814, 1582, 1582, 1582, 1999, 1999, 1797,
       1999, 1999, 1582, 1197, 1197, 1186], dtype=int64)

> Changing coloumn names

`['brand','cc','et','mpl','mdl','price','sc','am','vr']`

> **Description of coloumns**

|Coloumn Name| Description |
|------------|-------------|
|brand|Brand Name|
|cc|cubic centimeters (Engine displacement)|
|et|Engine Type(Petrol or Diesel)|
|kpl|Kilometer Per Liter|
|mdl|Model Name|
|Price|Price of Car in Rupees|
|sc|Seat Capacity|
|am|Transmission = Automatic / Manual|
|vr|Variant - Model Name description|

In [6]:
inocar.columns = ['brand','cc','et','kpl','mdl','price','sc','am','vr']
inocar.head()

  brand    cc      et    kpl mdl    price  sc         am                    vr
0  Audi  1968  Diesel  20.38  A3  3491000   5  Automatic   35 TDI Premium Plus
1  Audi  1968  Diesel  20.38  A3  3669000   5  Automatic     35 TDI Technology
2  Audi  1395  Petrol   19.2  A3  3310000   5  Automatic  35 TFSI Premium Plus
3  Audi  1395  Petrol   19.2  A3  3510000   5  Automatic    35 TFSI Technology
4  Audi  1968  Diesel  15.73  Q3  3653000   5     Manual    30 TDI Premium FWD

In [7]:
inocar.to_excel('inocar.xlsx',sheet_name='Cars',index=False)